test_results = [
    [85.4, 71.6, 93.2, 65.8, 45.0], #  результат дослідження першої групи
    [89.5, 80.0, 95.5, 76.5, 72.0]  #  результат дослідження другої групи
]
staff = {
     'Петрик': {
         'посаду': 'менеджер з продажу',
         'ефективність': 86
     },
     'Ткач': {
         'посаду': 'менеджер з продажу',
         'ефективність': 69
     },
     'Костін': {
         'посаду': 'менеджер з продажу',
         'ефективність': 78
     },
     'Костилєв': {
         'посаду': 'менеджер з продажу',
         'ефективність': 91
     },
     'Борисенко': {
         'посаду': 'менеджер з продажу',
         'ефективність': 99
     }
}

print(staff['Ткач']["посаду"])